{
	"body": [
		{
			"slug": "totivillus-scribe-of-hell",
			"name": "Totivillus, Scribe Of Hell",
			"size": "Medium",
			"type": "fiend",
			"subtype": "devil",
			"group": null,
			"alignment": "lawful evil",
			"armor_class": 19,
			"armor_desc": "natural armor",
			"hit_points": 299,
			"hit_dice": "26d8+182",
			"speed": {
				"walk": 40,
				"fly": 60
			},
			"strength": 18,
			"dexterity": 18,
			"constitution": 24,
			"intelligence": 26,
			"wisdom": 22,
			"charisma": 18,
			"strength_save": null,
			"dexterity_save": 11,
			"constitution_save": 14,
			"intelligence_save": 15,
			"wisdom_save": 13,
			"charisma_save": 11,
			"perception": 13,
			"skills": {
				"arcana": 15,
				"history": 15,
				"investigation": 15,
				"perception": 13,
				"religion": 15
			},
			"damage_vulnerabilities": "",
			"damage_resistances": "bludgeoning, piercing, and slashing from nonmagical weapons",
			"damage_immunities": "fire, poison",
			"condition_immunities": "poisoned",
			"senses": "truesight 30 ft., darkvision 60 ft., passive Perception 23",
			"languages": "Common, Celestial, Draconic, Infernal, Void Speech; telepathy 120 ft.",
			"challenge_rating": "24",
			"actions": [
				{
					"name": "Multiattack",
					"desc": "Totivillus makes two claw attacks."
				},
				{
					"name": "Claw",
					"desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 30 (4d12 + 4) slashing damage.",
					"attack_bonus": 11,
					"damage_dice": "4d12"
				},
				{
					"name": "Hellfire Bolt (Recharge 5-6)",
					"desc": "Ranged Spell Attack: +15 to hit, range 120 ft., one target. Hit: 65 (10d12) force damage plus 33 (6d10) thunder damage; a successful DC 20 Dexterity saving throw halves thunder damage.",
					"attack_bonus": 15,
					"damage_dice": "10d12"
				}
			],
			"reactions": "",
			"legendary_desc": "Totivillus can take 3 legendary actions, choosing from the options below. Only one option can be used at a time and only at the end of another creature's turn. Totivillus regains spent legendary actions at the start of its turn.",
			"legendary_actions": [
				{
					"name": "Claw Attack",
					"desc": "Totivillus makes one claw attack."
				},
				{
					"name": "Devil's Mark",
					"desc": "Totivillus sprays magical ink from his fingertips at a single target within 30 feet. The target must make a successful DC 23 Dexterity saving throw or receive a devil's mark: a tattoo in the shape of Totivillus's personal seal. All devils have advantage on spell attacks made against the devil-marked creature, and the creature has disadvantage on saving throws made against spells and abilities used by devils. The mark can be removed by remove curse if the caster also makes a successful DC 23 spellcasting check. The mark reveals itself as desecrated to detect evil and good. It often shifts its position on the body, especially when it's concealed (and usually at the most inconvenient moment). Because such marks are sometimes placed on those who've made pacts with devils, NPC paladins and clerics might assume that any character bearing a devil's mark is in league with evil forces."
				},
				{
					"name": "Cast a Spell (Costs 3 Actions)",
					"desc": "Totivillus casts a spell from its list of prepared spells, using a spell slot as normal."
				}
			],
			"special_abilities": [
				{
					"name": "Devil's Sight",
					"desc": "Magical darkness doesn't impede the devil's darkvision."
				},
				{
					"name": "Fear Aura",
					"desc": "Any creature hostile to Totivillus that starts its turn within 20 feet of him must make a DC 21 Wisdom saving throw, unless Totivillus is incapacitated. On a failed save, the creature is frightened until the start of its next turn. If a creature's saving throw is successful, it is immune to the devil's Fear Aura for the next 24 hours."
				},
				{
					"name": "Spellcasting",
					"desc": "totivillus is a 20th-level spellcaster who uses Intelligence as his spellcasting ability (spell save DC 23, +15 to hit with spell attacks). He requires no material components to cast his spells. Totivillus has the following wizard spells prepared:\n\ncantrips (at will): chill touch, light, minor illusion, poison spray, prestidigitation\n\n1st level (4 slots): comprehend languages, disguise self, illusory script, magic missile, unseen servant\n\n2nd level (3 slots): blindness/deafness, hold person, mirror image, misty step\n\n3rd level (3 slots): counterspell, dispel magic, haste, protection from energy\n\n4th level (3 slots): banishment, dimension door, greater invisibility, polymorph\n\n5th level (3 slots): dominate person, geas, modify memory, passwall\n\n6th level (2 slots): eyebite, guards and wards, mass suggestion\n\n7th level (2 slots): forcecage, plane shift\n\n8th level (1 slot): feeblemind\n\n9th level (1 slot): time stop"
				},
				{
					"name": "Magic Resistance",
					"desc": "The devil has advantage on saving throws against spells and other magical effects."
				},
				{
					"name": "Magic Weapons",
					"desc": "Totivillus's weapon attacks are magical."
				},
				{
					"name": "Meld with Text",
					"desc": "Totivillus can enter any book, scroll, or other written material and remain hidden there as long as he wishes. If the text is damaged or destroyed, he is ejected from it without suffering damage."
				},
				{
					"name": "Trust Aura",
					"desc": "Totivillus projects a 25-foot-radius trust aura. As long as Totivillus is talking, creatures in that area find his utterances so fascinating and compelling that they must make a DC 23 Wisdom saving throw at the start of each of their turns; if the saving throw fails, they can't attack Totivillus directly until the start of their next turn. This effect ends immediately and can't be renewed for 1 minute if Totivillus attacks physically. Devils are not immune to this aura."
				}
			],
			"spell_list": [],
			"img_main": null,
			"document__slug": "tob",
			"document__title": "Tome of Beasts OGL",
			"document__license_url": "http://open5e.com/legal"
		},
		{
			"slug": "adult-red-dragon",
			"name": "Adult Red Dragon",
			"size": "Huge",
			"type": "dragon",
			"subtype": "",
			"group": "Red Dragon",
			"alignment": "chaotic evil",
			"armor_class": 19,
			"armor_desc": "natural armor",
			"hit_points": 256,
			"hit_dice": "19d12+133",
			"speed": {
				"walk": 40,
				"climb": 40,
				"fly": 80
			},
			"strength": 27,
			"dexterity": 10,
			"constitution": 25,
			"intelligence": 16,
			"wisdom": 13,
			"charisma": 21,
			"strength_save": null,
			"dexterity_save": 6,
			"constitution_save": 13,
			"intelligence_save": null,
			"wisdom_save": 7,
			"charisma_save": 11,
			"perception": 13,
			"skills": {
				"perception": 13,
				"stealth": 6
			},
			"damage_vulnerabilities": "",
			"damage_resistances": "",
			"damage_immunities": "fire",
			"condition_immunities": "",
			"senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23",
			"languages": "Common, Draconic",
			"challenge_rating": "17",
			"actions": [
				{
					"name": "Multiattack",
					"desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."
				},
				{
					"name": "Bite",
					"desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 7 (2d6) fire damage.",
					"attack_bonus": 14,
					"damage_dice": "2d10+2d6",
					"damage_bonus": 8
				},
				{
					"name": "Claw",
					"desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.",
					"attack_bonus": 14,
					"damage_dice": "2d6",
					"damage_bonus": 8
				},
				{
					"name": "Tail",
					"desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.",
					"attack_bonus": 14,
					"damage_dice": "2d8",
					"damage_bonus": 8
				},
				{
					"name": "Frightful Presence",
					"desc": "Each creature of the dragon's choice that is within 120 ft. of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
				},
				{
					"name": "Fire Breath (Recharge 5-6)",
					"desc": "The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 63 (18d6) fire damage on a failed save, or half as much damage on a successful one.",
					"attack_bonus": 0,
					"damage_dice": "18d6"
				}
			],
			"reactions": "",
			"legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.",
			"legendary_actions": [
				{
					"name": "Detect",
					"desc": "The dragon makes a Wisdom (Perception) check."
				},
				{
					"name": "Tail Attack",
					"desc": "The dragon makes a tail attack."
				},
				{
					"name": "Wing Attack (Costs 2 Actions)",
					"desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
				}
			],
			"special_abilities": [
				{
					"name": "Legendary Resistance (3/Day)",
					"desc": "If the dragon fails a saving throw, it can choose to succeed instead."
				}
			],
			"spell_list": [],
			"img_main": null,
			"document__slug": "wotc-srd",
			"document__title": "Systems Reference Document",
			"document__license_url": "http://open5e.com/legal"
		}
	]
}
